ProgessBase/InformationRegisters/ТП_СтатусыОбъектовТендернойПлощадки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТП_СтатусыОбъектовТендернойПлощадки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_Рейсы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПТЛ_ПланДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ТП_СтавкиПоРейсам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ТП_СтавкиПоРейсам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_Рейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСтавки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВнесенияИнфо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/CommonModules/ТП_ИнтеграцияСТендернойПлощадкойОбщий/Ext/Module.bsl
//ВыполнитьОбменСТендернойПлощадкой
//
Процедура ТП_ВыполнитьОбменСТендернойПлощадкой() Экспорт
	
	Если ТекущаяДата() >= Константы.ТП_ДатаНачалаОбменаСТендернойПлощадкой.Получить() Тогда
	
		ИнтерфейсИнтеграцииСТендернойПлощадкой = Обработки.ТП_МодульИнтеграцииСТендернойПлощадкой.Создать();	
	    ИнтерфейсИнтеграцииСТендернойПлощадкой.ВыполнитьОбмен();
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьИндексСтатусТендера(Знач ИндексИЛИСтрокаСтатуса)Экспорт 

	СоответствиеСтатуса = Новый Соответствие;
	СоответствиеСтатуса.Вставить(0,"на формировании");	
	СоответствиеСтатуса.Вставить(1,"сформирован");
	СоответствиеСтатуса.Вставить(2,"опубликован");
	СоответствиеСтатуса.Вставить(3,"открыт");
	СоответствиеСтатуса.Вставить(4,"на согласовании");
	СоответствиеСтатуса.Вставить(5,"завершен");
	СоответствиеСтатуса.Вставить(6,"отменен");
	
	Если ТипЗнч(ИндексИЛИСтрокаСтатуса) = Тип("Число") Тогда
		
		тЭлемент = СоответствиеСтатуса.Получить(ИндексИЛИСтрокаСтатуса);
		Возврат ?(тЭлемент=Неопределено,-1,тЭлемент);
		
	Иначе
		
		ИндексИЛИСтрокаСтатуса = НРег(ИндексИЛИСтрокаСтатуса);
		
		Для каждого Элемент Из СоответствиеСтатуса Цикл
		
			Если Элемент.Значение = ИндексИЛИСтрокаСтатуса Тогда
			
				Возврат Элемент.Ключ;	
			
			КонецЕсли; 		
		
		КонецЦикла; 
		
	КонецЕсли; 

	Возврат -1;
	
КонецФункции // ПолучитьИндексСтатусаТендера()

Функция ПолучитьИндексСтатусРейса(Знач ИндексИЛИСтрокаСтатуса)Экспорт 

	СоответствиеСтатуса = Новый Соответствие;
	СоответствиеСтатуса.Вставить(0,"на оформлении");
	СоответствиеСтатуса.Вставить(1,"оформлена");
	СоответствиеСтатуса.Вставить(2,"распределена");
	СоответствиеСтатуса.Вставить(3,"торги");
	СоответствиеСтатуса.Вставить(4,"принята подрядчиком");
	СоответствиеСтатуса.Вставить(5,"незакрытая заявка");
	СоответствиеСтатуса.Вставить(6,"отменена грузоотправителем");
	СоответствиеСтатуса.Вставить(7,"подтверждена грузоотправителем");
	СоответствиеСтатуса.Вставить(8,"подтверждена приложенными документами");
	СоответствиеСтатуса.Вставить(9,"исполняется");
	СоответствиеСтатуса.Вставить(10,"все стадии помечены как исполненные");
	СоответствиеСтатуса.Вставить(11,"выполнена");
	СоответствиеСтатуса.Вставить(12,"счет выставлен");
	СоответствиеСтатуса.Вставить(13,"счет оплачен");
	СоответствиеСтатуса.Вставить(14,"завершена");
	СоответствиеСтатуса.Вставить(15,"ожидание распределения");
	СоответствиеСтатуса.Вставить(16,"отменена с копированием");
	СоответствиеСтатуса.Вставить(17,"выставлена претензия");
	СоответствиеСтатуса.Вставить(18,"сорванная заявка");
	СоответствиеСтатуса.Вставить(19,"отклонена перевозчиком");
	
	Если ТипЗнч(ИндексИЛИСтрокаСтатуса) = Тип("Число") Тогда
		
		тЭлемент = СоответствиеСтатуса.Получить(ИндексИЛИСтрокаСтатуса);
		Возврат ?(тЭлемент=Неопределено,-1,тЭлемент);
		
	Иначе
		
		ИндексИЛИСтрокаСтатуса = НРег(ИндексИЛИСтрокаСтатуса);
		
		Для каждого Элемент Из СоответствиеСтатуса Цикл
		
			Если Элемент.Значение = ИндексИЛИСтрокаСтатуса Тогда
			
				Возврат Элемент.Ключ;	
			
			КонецЕсли; 		
		
		КонецЦикла; 
		
	КонецЕсли; 

	Возврат -1;
	
КонецФункции // ПолучитьИндексСтатусРейса()
 
Функция ПолучитьСтатусОбъектовОбмена(МассивОбъектов,Знач НаДату=Неопределено)Экспорт
	
	Если НаДату=Неопределено Тогда
		НаДату=ТекущаяДата();	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТП_СтатусыОбъектовТендернойПлощадкиСрезПоследних.Объект,
		|	ТП_СтатусыОбъектовТендернойПлощадкиСрезПоследних.Статус,
		|	ТП_СтатусыОбъектовТендернойПлощадкиСрезПоследних.ОписаниеОшибки
		|ИЗ
		|	РегистрСведений.ТП_СтатусыОбъектовТендернойПлощадки.СрезПоследних(&НаДату, Объект В (&МассивОбъектов)) КАК ТП_СтатусыОбъектовТендернойПлощадкиСрезПоследних";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("НаДату", НаДату);

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции // ПолучитьСтатусОбъектаОбмена()
           
Функция ПолучитьСтавкиПоРейсам(МассивОбъектов)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТП_СтавкиПоРейсам.Рейс,
		|	ТП_СтавкиПоРейсам.Контрагент,
		|	ТП_СтавкиПоРейсам.ДатаСтавки,
		|	ТП_СтавкиПоРейсам.Ставка
		|ИЗ
		|	РегистрСведений.ТП_СтавкиПоРейсам КАК ТП_СтавкиПоРейсам
		|ГДЕ
		|	ТП_СтавкиПоРейсам.Рейс В(&МассивОбъектов)
		|	И НЕ ТП_СтавкиПоРейсам.Контрагент В
		|				(ВЫБРАТЬ
		|					ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСсылка
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ЗНАЧЕНИЕ(Справочник.Контрагенты.Неопределен))";

	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);

	Результат = Запрос.Выполнить().Выгрузить();

	Возврат Результат;

КонецФункции // ПолучитьСтавкиПоРейсам()
 
Процедура УдалитьДублирующиеЭлементыМассива(Массив)Экспорт 
	
	НовыйМассив = Новый Массив; Соответствие = Новый Соответствие;
	
	Для каждого ЭлементМассива Из Массив Цикл
		Соответствие.Вставить(ЭлементМассива);
	КонецЦикла;
	
	Для каждого КлючИЗначение Из Соответствие Цикл
		НовыйМассив.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;	
	
	Массив = НовыйМассив;

КонецПроцедуры  

Процедура ОткрытьФормуЖурналаОбмена(СтрокаПоиска="")Экспорт

	тФормаАнализаЛоговОбмена = Обработки.ТП_МодульИнтеграцииСТендернойПлощадкой.ПолучитьФорму("ФормаАнализаЛоговОбмена");
	тФормаАнализаЛоговОбмена.мСтрокаПоиска = СтрокаПоиска;
	тФормаАнализаЛоговОбмена.Открыть();

КонецПроцедуры
